package bot

const (
	helpMsg = `
📖 Список команд:

/today - Расписание на сегодня ⬇️
/tomorrow - Расписание на завтра ➡️
/week - Расписание на неделю ⬇️
/nextweek - Расписание на следующую неделю ➡️
/profile - Профиль 👤
/help - Список команд 📖
/info - О нас 📚
/start - Старт 🚀
`

	infoMsg = `
Здравствуй, я TimeTableBot! 👋
Помогаю узнавать расписание занятий в университетах Санкт-Петербурга. 😎 

Чтобы узнать свое расписание нажми /start и заполни "профиль", по этим параметрам я буду искать твое расписание.
`
)
